# 0.
from news.models import *

# 1. Задача - Создать двух пользователей
User.objects.create_user(username='Author_1', password='password_1', email='mail_1@mail.net', first_name='Аркадий', last_name='Аркадьев')
User.objects.create_user(username='Author_2', password='password_2', email='mail_2@mail.net', first_name='Борис', last_name='Борисов')
User.objects.create_user(username='Author_3', password='password_3', email='mail_3@mail.net', first_name='Валерий', last_name='Валерьев')

User.objects.create_user(username='Author_4', password='password_4', email='mail_4@mail.net', first_name='Григорий', last_name='Григорьев')
User.objects.create_user(username='Author_5', password='password_5', email='mail_5@mail.net', first_name='Дарья', last_name='Дарьева')
User.objects.create_user(username='User_6', password='password_6', email='mail_6@mail.net', first_name='Евгений', last_name='Евгеньев')
User.objects.create_user(username='User_7', password='password_7', email='mail_7@mail.net', first_name='Жора', last_name='Жоров')
User.objects.create_user(username='User_8', password='password_8', email='mail_8@mail.net', first_name='Зинаида', last_name='Зинаидова')
User.objects.create_user(username='User_9', password='password_9', email='mail_9@mail.net', first_name='Игнат', last_name='Игнатьев')
User.objects.create_user(username='User_10', password='password_10', email='mail_10@mail.net', first_name='Кристина', last_name='Кристинова')

# 2. Задача - Создать двух авторов (они же - "пользователи", только способные писать статьи)
Author.objects.create(user_id=User.objects.get(username='Author_1').pk)
Author.objects.create(user_id=User.objects.get(username='Author_2').pk)
Author.objects.create(user_id=User.objects.get(username='Author_3').pk)

Author.objects.create(user_id=User.objects.get(username='Author_4').pk)
Author.objects.create(user_id=User.objects.get(username='Author_5').pk)


# 3. Задача - Добавить категории
Category.objects.create(cat_name='Экстренно')
Category.objects.create(cat_name='Политика')
Category.objects.create(cat_name='Спорт')
Category.objects.create(cat_name='Культура')
Category.objects.create(cat_name='Погода')
Category.objects.create(cat_name='Происшествия')

# 4. Задача - Добавить две статьи и одну новость
post_1=Post.objects.create(type=1, header='Заголовок статьи 1', text='Текст статьи 1', author_id=Author.objects.get(user_id=User.objects.get(username='Author_1').pk).pk)
post_2=Post.objects.create(type=1, header='Заголовок статьи 2', text='Текст статьи 2', author_id=Author.objects.get(user_id=User.objects.get(username='Author_2').pk).pk)
post_3=Post.objects.create(type=0, header='Заголовок новости 1', text='Текст новости 1', author_id=Author.objects.get(user_id=User.objects.get(username='Author_2').pk).pk)

post_4=Post.objects.create(type=0, header='Заголовок новости 2', text='Текст новости 2 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_1').pk).pk)
post_5=Post.objects.create(type=0, header='Заголовок новости 3', text='Текст новости 3 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_1').pk).pk)
post_6=Post.objects.create(type=1, header='Заголовок статьи 4', text='Текст статьи 4 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_1').pk).pk)
post_7=Post.objects.create(type=0, header='Заголовок новости 5', text='Текст новости 5 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_1').pk).pk)
post_8=Post.objects.create(type=0, header='Заголовок новости 6', text='Текст новости 6 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_1').pk).pk)
post_9=Post.objects.create(type=0, header='Заголовок новости 3', text='Текст новости 3 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_2').pk).pk)
post_10=Post.objects.create(type=0, header='Заголовок новости 4', text='Текст новости 4 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_2').pk).pk)
post_11=Post.objects.create(type=0, header='Заголовок новости 5', text='Текст новости 5 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_2').pk).pk)
post_12=Post.objects.create(type=0, header='Заголовок новости 6', text='Текст новости 6 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_2').pk).pk)
post_13=Post.objects.create(type=0, header='Заголовок новости 7', text='Текст новости 7 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_2').pk).pk)
post_14=Post.objects.create(type=1, header='Заголовок статьи 1', text='Текст статьи 1 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_15=Post.objects.create(type=1, header='Заголовок статьи 2', text='Текст статьи 2 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_16=Post.objects.create(type=1, header='Заголовок статьи 3', text='Текст статьи 3 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_17=Post.objects.create(type=1, header='Заголовок статьи 4', text='Текст статьи 4 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_18=Post.objects.create(type=1, header='Заголовок статьи 5', text='Текст статьи 5 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_19=Post.objects.create(type=0, header='Заголовок новости 6', text='Текст новости 6 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_20=Post.objects.create(type=0, header='Заголовок новости 7', text='Текст новости 7 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_21=Post.objects.create(type=0, header='Заголовок новости 8', text='Текст новости 8 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_22=Post.objects.create(type=0, header='Заголовок новости 9', text='Текст новости 9 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_23=Post.objects.create(type=0, header='Заголовок новости 10', text='Текст новости 10 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_3').pk).pk)
post_24=Post.objects.create(type=1, header='Заголовок статьи 1', text='Текст статьи 1 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_25=Post.objects.create(type=1, header='Заголовок статьи 2', text='Текст статьи 2 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_26=Post.objects.create(type=1, header='Заголовок статьи 3', text='Текст статьи 3 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_27=Post.objects.create(type=1, header='Заголовок статьи 4', text='Текст статьи 4 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_28=Post.objects.create(type=1, header='Заголовок статьи 5', text='Текст статьи 5 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_29=Post.objects.create(type=0, header='Заголовок новости 6', text='Текст новости 6 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_30=Post.objects.create(type=0, header='Заголовок новости 7', text='Текст новости 7 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_31=Post.objects.create(type=0, header='Заголовок новости 8', text='Текст новости 8 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_32=Post.objects.create(type=0, header='Заголовок новости 9', text='Текст новости 9 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_33=Post.objects.create(type=0, header='Заголовок новости 10', text='Текст новости 10 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_4').pk).pk)
post_34=Post.objects.create(type=1, header='Заголовок статьи 1', text='Текст статьи 1 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_35=Post.objects.create(type=1, header='Заголовок статьи 2', text='Текст статьи 2 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_36=Post.objects.create(type=1, header='Заголовок статьи 11', text='Текст статьи 11 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_37=Post.objects.create(type=1, header='Заголовок статьи 4', text='Текст статьи 4 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_38=Post.objects.create(type=1, header='Заголовок статьи 5', text='Текст статьи 5 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_39=Post.objects.create(type=0, header='Заголовок новости 6', text='Текст новости 6 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_40=Post.objects.create(type=0, header='Заголовок новости 7', text='Текст новости 7 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_41=Post.objects.create(type=0, header='Заголовок новости 8', text='Текст новости 8 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_42=Post.objects.create(type=0, header='Заголовок новости 9', text='Текст новости 9 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)
post_43=Post.objects.create(type=0, header='Заголовок новости 10', text='Текст новости 10 более длинный текст', author_id=Author.objects.get(user_id=User.objects.get(username='Author_5').pk).pk)

# 5. Задача - присвоить созданным статьям/новостям несколько категорий
PostCategory.objects.create(post_id=post_1.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_1.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_2.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_2.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_3.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_3.id, category_id= Category.objects.get(cat_name='Происшествия').pk)
PostCategory.objects.create(post_id=post_4.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_4.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_5.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_5.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_6.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_6.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_7.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_7.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_8.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_8.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_9.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_9.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_10.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_10.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_11.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_11.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_12.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_12.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_13.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_13.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_14.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_14.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_15.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_15.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_16.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_16.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_17.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_17.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_18.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_18.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_19.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_19.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_20.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_20.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_21.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_21.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_22.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_22.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_23.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_23.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_24.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_24.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_25.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_25.id, category_id= Category.objects.get(cat_name='Политика').pk)
PostCategory.objects.create(post_id=post_26.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_26.id, category_id= Category.objects.get(cat_name='Погода').pk)
PostCategory.objects.create(post_id=post_27.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_27.id, category_id= Category.objects.get(cat_name='Погода').pk)
PostCategory.objects.create(post_id=post_28.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_28.id, category_id= Category.objects.get(cat_name='Погода').pk)
PostCategory.objects.create(post_id=post_29.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_29.id, category_id= Category.objects.get(cat_name='Погода').pk)
PostCategory.objects.create(post_id=post_30.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_30.id, category_id= Category.objects.get(cat_name='Погода').pk)

PostCategory.objects.create(post_id=post_31.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_31.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_32.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_32.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_33.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_33.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_34.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_34.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_35.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_35.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_36.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_36.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_37.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_37.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_38.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_38.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_39.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_39.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_40.id, category_id= Category.objects.get(cat_name='Спорт').pk)
PostCategory.objects.create(post_id=post_40.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_41.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_41.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_42.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_42.id, category_id= Category.objects.get(cat_name='Экстренно').pk)
PostCategory.objects.create(post_id=post_43.id, category_id= Category.objects.get(cat_name='Культура').pk)
PostCategory.objects.create(post_id=post_43.id, category_id= Category.objects.get(cat_name='Экстренно').pk)

# 6. Задача - Создать комментарии к постам
comm_1=Comment.objects.create(post_id=post_1.id, user_id=User.objects.get(username='Author_2').pk, text='Комментарий 1 от пользователя 2 на пост 1 автора 1')
comm_2=Comment.objects.create(post_id=post_1.id, user_id=User.objects.get(username='Author_2').pk, text='Комментарий 2 от пользователя 2 на пост 1 автора 1')
comm_3=Comment.objects.create(post_id=post_1.id, user_id=User.objects.get(username='Author_2').pk, text='Комментарий 3 от пользователя 2 на пост 1 автора 1')
comm_4=Comment.objects.create(post_id=post_2.id, user_id=User.objects.get(username='Author_1').pk, text='Комментарий 1 от пользователя 1 на пост 2 автора 2')
comm_5=Comment.objects.create(post_id=post_2.id, user_id=User.objects.get(username='Author_1').pk, text='Комментарий 2 от пользователя 1 на пост 2 автора 2')
comm_6=Comment.objects.create(post_id=post_3.id, user_id=User.objects.get(username='Author_1').pk, text='Комментарий 1 от пользователя 1 на пост 3 автора 2')

# 7. Задача - "поставить" лайки и дизлайки
post_1.like()
post_1.like()
post_1.like()
post_1.like()
post_1.like()
post_1.like()
post_1.like()
post_1.like()
post_2.like()
post_2.like()
post_2.like()
post_2.like()
post_3.like()
post_3.like()
comm_1.like()
comm_2.dislike()
comm_2.dislike()
comm_3.dislike()
comm_4.like()
comm_4.like()
comm_5.like()
comm_5.like()
comm_5.like()
comm_6.like()

# 8. Задача - обновить рейтинг пользователей (авторов)
Author.objects.get(user_id=User.objects.get(username='Author_1').pk).update_rating()
Author.objects.get(user_id=User.objects.get(username='Author_2').pk).update_rating()

# 9. Задача - Вычислить лучшего (по рейтингу) пользователя
print(f"Пользователь {User.objects.get(id=Author.objects.order_by('rating').last().user_id).username} имеет лучший рейтинг из всех: {Author.objects.order_by('rating').last().rating} баллов")

# 10. Задача - Найти лучшую статью и вывести данные по ней
bestpost=Post.objects.order_by('rating').last().id
bp_date=Post.objects.get(id=bestpost).m_of_creation.date()
bp_author=User.objects.get(id=Author.objects.get(id=Post.objects.get(id=bestpost).author_id).user_id).username
bp_title=Post.objects.get(id=bestpost).header
bp_body=Post.objects.get(id=bestpost).text
print(f"<<Лучшая статья>>:\nдата: {bp_date}\nАвтор: {bp_author}\nНазвание: {bp_title}\nКраткое содержание (очень):{bp_body[0:10]}")

# 11. Задача - Найти все комментарии к лучшей (по рейтингу) статье
c_bestpost=Comment.objects.filter(post_id=bestpost).order_by('-m_of_comm')
print("Лучшие комментарии:\n")
for i in c_bestpost:
    print(f"Дата: {i.m_of_comm.date()}\nАвтор: {User.objects.get(id=i.user_id).username}\nРейтинг: {i.rating}\nТекст: {i.text}\n")